valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxEray_reg.h
/**
 * \file IfxEray_reg.h
 * \brief
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC33X32X_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Eray_Registers_Cfg Eray address
 * \ingroup IfxSfr_Eray_Registers
 * 
 * \defgroup IfxSfr_Eray_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Eray_Registers_Cfg
 *
 * \defgroup IfxSfr_Eray_Registers_Cfg_Eray0 2-ERAY0
 * \ingroup IfxSfr_Eray_Registers_Cfg
 *
 *
 */
#ifndef IFXERAY_REG_H
#define IFXERAY_REG_H 1
/******************************************************************************/
#include "IfxEray_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Eray_Registers_Cfg_BaseAddress
 * \{  */

/** \brief ERAY object */
#define MODULE_ERAY0 /*lint --e(923, 9078)*/ ((*(Ifx_ERAY*)0xF001C000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Eray_Registers_Cfg_Eray0
 * \{  */
/** \brief 0, Clock Control Register */
#define ERAY0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CLC*)0xF001C000u)

/** \brief 4, Busy and Input Buffer Control Register */
#define ERAY0_CUST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CUST1*)0xF001C004u)

/** \brief 8, Module Identification Register */
#define ERAY0_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ID*)0xF001C008u)

/** \brief C, Customer Interface Timeout Counter Register */
#define ERAY0_CUST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CUST3*)0xF001C00Cu)

/** \brief 10, Test Register 1 */
#define ERAY0_TEST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TEST1*)0xF001C010u)

/** \brief 14, Test Register 2 */
#define ERAY0_TEST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TEST2*)0xF001C014u)

/** \brief 1C, Lock Register */
#define ERAY0_LCK /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_LCK*)0xF001C01Cu)

/** \brief 20, Error Service Request Select Register */
#define ERAY0_EIR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIR*)0xF001C020u)

/** \brief 24, Status Service Request Register */
#define ERAY0_SIR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIR*)0xF001C024u)

/** \brief 28, Error Service Request Line Select */
#define ERAY0_EILS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EILS*)0xF001C028u)

/** \brief 2C, Status Service Request Line Select */
#define ERAY0_SILS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SILS*)0xF001C02Cu)

/** \brief 30, Error Service Request Enable Set */
#define ERAY0_EIES /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIES*)0xF001C030u)

/** \brief 34, Error Service Request Enable Reset */
#define ERAY0_EIER /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_EIER*)0xF001C034u)

/** \brief 38, Status Service Request Enable Set */
#define ERAY0_SIES /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIES*)0xF001C038u)

/** \brief 3C, Status Service Request Enable Reset */
#define ERAY0_SIER /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SIER*)0xF001C03Cu)

/** \brief 40, Service Request Line Enable */
#define ERAY0_ILE /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ILE*)0xF001C040u)

/** \brief 44, Timer 0 Configuration */
#define ERAY0_T0C /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_T0C*)0xF001C044u)

/** \brief 48, Timer 1 Configuration */
#define ERAY0_T1C /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_T1C*)0xF001C048u)

/** \brief 4C, Stop Watch Register 1 */
#define ERAY0_STPW1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_STPW1*)0xF001C04Cu)

/** \brief 50, Stop Watch Register 2 */
#define ERAY0_STPW2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_STPW2*)0xF001C050u)

/** \brief 80, SUC Configuration Register 1 */
#define ERAY0_SUCC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC1*)0xF001C080u)

/** \brief 84, SUC Configuration Register 2 */
#define ERAY0_SUCC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC2*)0xF001C084u)

/** \brief 88, SUC Configuration Register 3 */
#define ERAY0_SUCC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_SUCC3*)0xF001C088u)

/** \brief 8C, NEM Configuration Register */
#define ERAY0_NEMC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NEMC*)0xF001C08Cu)

/** \brief 90, PRT Configuration Register 1 */
#define ERAY0_PRTC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_PRTC1*)0xF001C090u)

